---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AdditionalLoad
source: html/4d1eafe2-5a2e-e49c-9d59-bc4649899ada.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AdditionalLoad Property

Additional load to be included during demand load calculation.

## Syntax (C#)
```csharp
public double AdditionalLoad { get; set; }
```